eksempler/soap/5_response_forretningskvittering_fra_meldingsformidler_til_postavsender.xml

<S12:Envelope xmlns:S12="http://www.w3.org/2003/05/soap-envelope" xmlns:eb="http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <S12:Header>
    <wsse:Security S12:mustUnderstand="true">
      <!-- TODO  -->
    </wsse:Security>
    <eb:Messaging S12:mustUnderstand="true">
	    <eb:UserMessage mpc="urn:sdp:avsenderid:12345">
        <eb:MessageInfo>
          <eb:Timestamp>2006-10-01T10:02:00</eb:Timestamp>
          <eb:MessageId>UUID-5@sender.example.com</eb:MessageId>
          <eb:RefToMessageId>UUID-4@receiver.example.com</eb:RefToMessageId>
        </eb:MessageInfo>

		    <eb:PartyInfo>
			    <eb:From>
				    <eb:PartyId type="urn:oasis:names:tc:ebcore:partyid-type:iso6523:9908">%%ORG_NR_MF%%</eb:PartyId>
				    <eb:Role>Meldingsformidler</eb:Role>
			    </eb:From>
			    <eb:To>
				    <eb:PartyId type="urn:oasis:names:tc:ebcore:partyid-type:iso6523:9908">%%ORG_NR_DATABEHANDLER%%</eb:PartyId>
				    <eb:Role>Avsender</eb:Role>
			    </eb:To>
		    </eb:PartyInfo>
        
        
        <eb:CollaborationInfo>
	        <eb:AgreementRef>http://begrep.difi.no/SikkerDigitalPost/Meldingsutveksling/FormidleDigitalPostForsendelse</eb:AgreementRef>
	        <eb:Service>urn:sdp:service:sdp</eb:Service>
	        <eb:Action>FormidleDigitalPost</eb:Action>
	        <eb:ConversationId>GUID-ConversationId</eb:ConversationId>
	      </eb:CollaborationInfo>

		    <eb:PayloadInfo>
			    <!-- Avsender setter href selv, men MÅ alltid peke på SOAP body -->
			    <eb:PartInfo href="#soapBody">
				    <eb:PartProperties>
					    <!-- MimeType MÅ alltid settes til application/xml -->
					    <eb:Property name="MimeType">application/xml</eb:Property>
				    </eb:PartProperties>
			    </eb:PartInfo>
		    </eb:PayloadInfo>
      </eb:UserMessage>
    </eb:Messaging>
  </S12:Header>
  <S12:Body xml:id="soapBody">
	  <StandardBusinessDocument xmlns="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader">
		  <StandardBusinessDocumentHeader>
			  <HeaderVersion>1.0</HeaderVersion>
			  <Sender>
				  <!-- orgnr avsender -->
				  <Identifier Authority="iso6523-actorid-upis">9908:123456789</Identifier>
			  </Sender>
			  <Receiver>
				  <!-- orgnr mottaker, postboks eller print -->
				  <Identifier Authority="iso6523-actorid-upis">9908:345678901</Identifier>
			  </Receiver>
			  <DocumentIdentification>
				  <!-- Unik identifikator i "Sender" sitt scope -->
				  <Standard>urn:no:kommune:leikanger:sdp:barnehage:1.0</Standard>
				  <TypeVersion>1.0</TypeVersion>
				  <!-- Dette er den reelle unike identifikatoren i SDBH - bør vera GUID! -->
				  <InstanceIdentifier>GUID-Conversation-ID</InstanceIdentifier>
				  <Type>Sikkerpost</Type>
				  <CreationDateAndTime>2013-02-19T05:10:10Z</CreationDateAndTime>
			  </DocumentIdentification>
		  </StandardBusinessDocumentHeader>
		  <sdp:meldingskvittering xmlns:sdp="http://begrep.difi.no/sdp/schema_v10">
			  <!-- .... -->
		  </sdp:meldingskvittering>
	  </StandardBusinessDocument>
  </S12:Body>
</S12:Envelope>