functional/ws/templates/PnPGoodsInwardExample.xml

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP:Header />
    <SOAP:Body>
        <sh:StandardBusinessDocument xmlns:sh="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader" xmlns:deliver="urn:ean.ucc:deliver:2" xmlns:eanucc="urn:ean.ucc:2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <sh:StandardBusinessDocumentHeader>
                <sh:HeaderVersion>1.0</sh:HeaderVersion>
                <sh:Sender>
                    <sh:Identifier Authority="EAN.UCC">6001000000001</sh:Identifier>
                </sh:Sender>
                <sh:Receiver>
                    <sh:Identifier Authority="EAN.UCC">6001007802929</sh:Identifier>
                </sh:Receiver>
                <sh:DocumentIdentification>
                    <sh:Standard>EAN.UCC</sh:Standard>
                    <sh:TypeVersion>2.5</sh:TypeVersion>
                    <sh:InstanceIdentifier>0000000129265361</sh:InstanceIdentifier>
                    <sh:Type>ReceivingAdvice</sh:Type>
                    <sh:MultipleType>false</sh:MultipleType>
                    <sh:CreationDateAndTime>2012-05-15T00:00:00</sh:CreationDateAndTime>
                </sh:DocumentIdentification>
            </sh:StandardBusinessDocumentHeader>
            <eanucc:message>
                <entityIdentification>
                    <uniqueCreatorIdentification>G_REC_5000001180</uniqueCreatorIdentification>
                    <contentOwner>
                        <gln>6001000000001</gln>
                    </contentOwner>
                </entityIdentification>
                <eanucc:transaction>
                    <entityIdentification>
                        <uniqueCreatorIdentification>G_REC_5000001180</uniqueCreatorIdentification>
                        <contentOwner>
                            <gln>6001000000001</gln>
                        </contentOwner>
                    </entityIdentification>
                    <command>
                        <eanucc:documentCommand>
                            <documentCommandHeader type="ADD">
                                <entityIdentification>
                                    <uniqueCreatorIdentification>G_REC_5000001180</uniqueCreatorIdentification>
                                    <contentOwner>
                                        <gln>6001000000001</gln>
                                    </contentOwner>
                                </entityIdentification>
                            </documentCommandHeader>
                            <documentCommandOperand>
                                <deliver:receivingAdvice creationDateTime="2012-05-15T00:00:00" documentStatus="ORIGINAL">
                                    <documentStructureVersion>
                                        <versionIdentification>2.5</versionIdentification>
                                    </documentStructureVersion>
                                    <reportingCode>CONFIRMATION</reportingCode>
                                    <receivingAdviceIdentification>
                                        <uniqueCreatorIdentification>G_REC_5000001180</uniqueCreatorIdentification>
                                        <contentOwner>
                                            <gln>6001000000001</gln>
                                        </contentOwner>
                                    </receivingAdviceIdentification>
                                    <shipTo>
                                        <gln>6001007031046</gln>
                                        <additionalPartyIdentification>
                                            <additionalPartyIdentificationValue>WC04</additionalPartyIdentificationValue>
                                            <additionalPartyIdentificationType>BUYER_ASSIGNED_IDENTIFIER_FOR_A_PARTY</additionalPartyIdentificationType>
                                        </additionalPartyIdentification>
                                    </shipTo>
                                    <shipper>
                                        <gln>6002531000959</gln>
                                    </shipper>
                                    <receiver>
                                        <gln>6001007031046</gln>
                                    </receiver>
                                    <receivingAdviceItemContainmentLineItem number="0001">
                                        <containedItemIdentification>
                                            <gtin>8710428104380</gtin>
                                            <additionalTradeItemIdentification>
                                                <additionalTradeItemIdentificationValue>P8152</additionalTradeItemIdentificationValue>
                                                <additionalTradeItemIdentificationType>SUPPLIER_ASSIGNED</additionalTradeItemIdentificationType>
                                            </additionalTradeItemIdentification>
                                            <additionalTradeItemIdentification>
                                                <additionalTradeItemIdentificationValue>PRODUCT 001 900GR</additionalTradeItemIdentificationValue>
                                                <additionalTradeItemIdentificationType>BUYER_ASSIGNED</additionalTradeItemIdentificationType>
                                            </additionalTradeItemIdentification>
                                            <additionalTradeItemIdentification>
                                                <additionalTradeItemIdentificationValue>000000000000386907</additionalTradeItemIdentificationValue>
                                                <additionalTradeItemIdentificationType>BUYER_ASSIGNED</additionalTradeItemIdentificationType>
                                            </additionalTradeItemIdentification>
                                        </containedItemIdentification>
                                        <specification number="0">
                                            <reference>
                                                <referenceDateTime>0000-00-00T00:00:00.000</referenceDateTime>
                                                <referenceIdentification>426543658-INV</referenceIdentification>
                                            </reference>
                                        </specification>
                                        <purchaseOrder>
                                            <documentReference creationDateTime="0000-00-00T00:00:00.000">
                                                <uniqueCreatorIdentification>0426543658</uniqueCreatorIdentification>
                                                <contentOwner>
                                                    <gln>6001000000001</gln>
                                                </contentOwner>
                                            </documentReference>
                                        </purchaseOrder>
                                        <quantityAccepted>
                                            <value>3.000</value>
                                            <unitOfMeasure>
                                                <measurementUnitCodeValue>CS</measurementUnitCodeValue>
                                            </unitOfMeasure>
                                        </quantityAccepted>
                                        <quantityReceived>
                                            <value>3.000</value>
                                            <unitOfMeasure>
                                                <measurementUnitCodeValue>CS</measurementUnitCodeValue>
                                            </unitOfMeasure>
                                        </quantityReceived>
                                        <receivingConditionInformation>
                                            <receivingCondition>GOOD_CONDITION</receivingCondition>
                                            <receivingConditionQuantity>
                                                <value>9</value>
                                            </receivingConditionQuantity>
                                        </receivingConditionInformation>
                                    </receivingAdviceItemContainmentLineItem>
                                    <receivingAdviceItemContainmentLineItem number="0002">
                                        <containedItemIdentification>
                                            <gtin>16001127500689</gtin>
                                            <additionalTradeItemIdentification>
                                                <additionalTradeItemIdentificationValue>P91540F</additionalTradeItemIdentificationValue>
                                                <additionalTradeItemIdentificationType>SUPPLIER_ASSIGNED</additionalTradeItemIdentificationType>
                                            </additionalTradeItemIdentification>
                                            <additionalTradeItemIdentification>
                                                <additionalTradeItemIdentificationValue>PRODUCT 002 400GR</additionalTradeItemIdentificationValue>
                                                <additionalTradeItemIdentificationType>BUYER_ASSIGNED</additionalTradeItemIdentificationType>
                                            </additionalTradeItemIdentification>
                                            <additionalTradeItemIdentification>
                                                <additionalTradeItemIdentificationValue>000000000000372668</additionalTradeItemIdentificationValue>
                                                <additionalTradeItemIdentificationType>BUYER_ASSIGNED</additionalTradeItemIdentificationType>
                                            </additionalTradeItemIdentification>
                                        </containedItemIdentification>
                                        <specification number="0">
                                            <reference>
                                                <referenceDateTime>0000-00-00T00:00:00.000</referenceDateTime>
                                                <referenceIdentification>426543658-INV</referenceIdentification>
                                            </reference>
                                        </specification>
                                        <purchaseOrder>
                                            <documentReference creationDateTime="0000-00-00T00:00:00.000">
                                                <uniqueCreatorIdentification>0426543658</uniqueCreatorIdentification>
                                                <contentOwner>
                                                    <gln>6001000000001</gln>
                                                </contentOwner>
                                            </documentReference>
                                        </purchaseOrder>
                                        <quantityAccepted>
                                            <value>1.000</value>
                                            <unitOfMeasure>
                                                <measurementUnitCodeValue>CS</measurementUnitCodeValue>
                                            </unitOfMeasure>
                                        </quantityAccepted>
                                        <quantityReceived>
                                            <value>1.000</value>
                                            <unitOfMeasure>
                                                <measurementUnitCodeValue>CS</measurementUnitCodeValue>
                                            </unitOfMeasure>
                                        </quantityReceived>
                                        <receivingConditionInformation>
                                            <receivingCondition>GOOD_CONDITION</receivingCondition>
                                            <receivingConditionQuantity>
                                                <value>9</value>
                                            </receivingConditionQuantity>
                                        </receivingConditionInformation>
                                    </receivingAdviceItemContainmentLineItem>
                                    <receivingAdviceItemContainmentLineItem number="0003">
                                        <containedItemIdentification>
                                            <gtin>16001127500696</gtin>
                                            <additionalTradeItemIdentification>
                                                <additionalTradeItemIdentificationValue>P917140F</additionalTradeItemIdentificationValue>
                                                <additionalTradeItemIdentificationType>SUPPLIER_ASSIGNED</additionalTradeItemIdentificationType>
                                            </additionalTradeItemIdentification>
                                            <additionalTradeItemIdentification>
                                                <additionalTradeItemIdentificationValue>PRODUCT 003 400GR</additionalTradeItemIdentificationValue>
                                                <additionalTradeItemIdentificationType>BUYER_ASSIGNED</additionalTradeItemIdentificationType>
                                            </additionalTradeItemIdentification>
                                            <additionalTradeItemIdentification>
                                                <additionalTradeItemIdentificationValue>000000000000372669</additionalTradeItemIdentificationValue>
                                                <additionalTradeItemIdentificationType>BUYER_ASSIGNED</additionalTradeItemIdentificationType>
                                            </additionalTradeItemIdentification>
                                        </containedItemIdentification>
                                        <specification number="0">
                                            <reference>
                                                <referenceDateTime>0000-00-00T00:00:00.000</referenceDateTime>
                                                <referenceIdentification>426543658-INV</referenceIdentification>
                                            </reference>
                                        </specification>
                                        <purchaseOrder>
                                            <documentReference creationDateTime="0000-00-00T00:00:00.000">
                                                <uniqueCreatorIdentification>0426543658</uniqueCreatorIdentification>
                                                <contentOwner>
                                                    <gln>6001000000001</gln>
                                                </contentOwner>
                                            </documentReference>
                                        </purchaseOrder>
                                        <quantityAccepted>
                                            <value>1.000</value>
                                            <unitOfMeasure>
                                                <measurementUnitCodeValue>CS</measurementUnitCodeValue>
                                            </unitOfMeasure>
                                        </quantityAccepted>
                                        <quantityReceived>
                                            <value>1.000</value>
                                            <unitOfMeasure>
                                                <measurementUnitCodeValue>CS</measurementUnitCodeValue>
                                            </unitOfMeasure>
                                        </quantityReceived>
                                        <receivingConditionInformation>
                                            <receivingCondition>GOOD_CONDITION</receivingCondition>
                                            <receivingConditionQuantity>
                                                <value>9</value>
                                            </receivingConditionQuantity>
                                        </receivingConditionInformation>
                                    </receivingAdviceItemContainmentLineItem>
                                    <receiptInformation>
                                        <receivingDateTime>2012-05-15T00:00:00</receivingDateTime>
                                    </receiptInformation>
                                    <consignmentIdentification>
                                        <referenceDateTime>2012-05-15T00:00:00</referenceDateTime>
                                        <referenceIdentification>426543658-INV</referenceIdentification>
                                    </consignmentIdentification>
                                </deliver:receivingAdvice>
                            </documentCommandOperand>
                        </eanucc:documentCommand>
                    </command>
                </eanucc:transaction>
            </eanucc:message>
        </sh:StandardBusinessDocument>
    </SOAP:Body>
</SOAP:Envelope>
